Revit 2024 API
BuiltInFailures.CurtainWallFailures.InvalidSkipSegments Property
 A curtain grid line had invalid removed segment data. When correcting data, Revit may have split curtain panels that should be combined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidSkipSegments { get; }
Visual Basic
Public Shared ReadOnly Property InvalidSkipSegments As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidSkipSegments {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace